{
    "topics": [
        {
            "name": "Intel & AMD Processor Hierarchy",
            "author": "kds",
            "img": "http://www.userbenchmark.com/resources/img/icons/Desktop_128.png",
            "text": "Fans of our Best Gaming CPUs for the Money column will recognize the hierarchy chart as a side-by-side comparison tool designed to help you pick an appropriate processing upgrade. It groups CPUs with roughly similar gaming performance into tiers. The top tier contains the highest-performing CPUs available and gaming performance decreases as you descend.      This hierarchy was originally based on the average performance each CPU achieved in our test suite. We have since incorporated new game data into our criteria, but it should be known that any specific title will likely perform differently depending on its unique programming. Some games, for example, will be severely graphics subsystem-limited, while others may react positively to more CPU cores, larger amounts of on-die cache or even a specific architecture. We don't have access to every CPU on the market, so some of the placements are based on the results similar models deliver. Indeed, this hierarchy chart is useful as a general guideline, but certainly not as a one-size-fits-all CPU comparison resource. For that, we recommend you check out our CPU Performance Charts.      Perhaps you noticed that we split the former top tier in half, moving a handful of quad-module AMD CPUs up in the process. Recognizing that a lot of older platforms are going to be paired with graphics subsystems multiple generations old, we wanted to define the top of our range to encourage balance between host processing and complementary GPUs. At this point, anyone with a Sandy Bridge-based Core i7 would realize a gain from stepping up to Skylake or Haswell-E, for example. And putting AMD's top FX CPUs next to a handful of Core i7s and those older Core i5s represents an upgrade to their status.      ",
            "date": "2016-05-13T16:42:58.705Z"
        },
        {
            "name": "Driver Distribution Change for Windows 10, version 1607",
            "author": "Joshua",
            "img": "",
            "text": "Version 1607 of the Windows HLK enables you to distribute drivers to specific Windows 10 versions through Windows Update. When you distribute to a specific version of Windows 10, the Hardware Dev Portal submission must contain HLK results for that version. If distributing to all Windows 10 versions, you must include results for each version…",
            "date": "2016-12-10T10:34:00.705Z"
        },
        {
            "name": "Third generation",
            "author": "kds",
            "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Data_General_NOVA_System.jpg/450px-Data_General_NOVA_System.jpg",
            "text": "The mass increase in the use of computers accelerated with 'Third Generation' computers. These generally relied on Jack Kilby's invention of the integrated circuit (or microchip), starting around 1965. However, the IBM System/360 used hybrid circuits, which were solid-state devices interconnected on a substrate with discrete wires. The first integrated circuit was produced in September 1958, but computers using them didn't begin to appear until 1963. Some of their early uses were in embedded systems, notably used by NASA for the Apollo Guidance Computer, by the military in the LGM-30 Minuteman intercontinental ballistic missile, the Honeywell ALERT airborne computer,[1] and in the Central Air Data Computer used for flight control in the US Navy's F-14A Tomcat fighter jet. Large mainframe computers, such as the System/360, increased storage and processing abilities, while the integrated circuit also allowed development of much smaller computers. The minicomputer was a significant innovation in the 1960s and 1970s. It brought computing power to more people, not only through more convenient physical size but also through broadening the computer vendor field. Digital Equipment Corporation became the number two computer company behind IBM with their popular PDP and VAX computer systems. Smaller, affordable hardware also brought about the development of important new operating systems such as Unix.1969 Data General Nova.In November 1966, Hewlett-Packard introduced the 2116A[2][3] minicomputer, one of the first commercial 16-bit computers. It used CTµL (Complementary Transistor MicroLogic)[4] in integrated circuits from Fairchild Semiconductor. Hewlett-Packard followed this with similar 16-bit computers, such as the 2115A in 1967,[5] the 2114A in 1968,[6] and others.In 1969, Data General introduced the Nova and shipped a total of 50,000 at $8,000 each. The popularity of 16-bit computers, such as the Hewlett-Packard 21xx series and the Data General Nova, led the way toward word lengths that were multiples of the 8-bit bye. The Nova was first to employ medium-scale integration (MSI) circuits from Fairchild Semiconductor, with subsequent models using large-scale integrated (LSI) circuits. Also notable was that the entire central processor was contained on one 15-inch printed circuit board.By 1971, the Illiac IV supercomputer was the fastest computer in the world, using about a quarter-million small-scale ECL logic gate integrated circuits to make up sixty-four parallel data processors.",
            "date": "Fri Dec 23 2016 19:50:04 GMT+0200 (Финляндия (зима))"
        }
    ]
}